



"""
Цикл

Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли."""







str_dict = input('введите первую строку: ')
for number in str_dict:
    print(number)




