
"""
Цикл

Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.

"""


digits = [22, 25, 222, 5653, 2312, 1111, 1234, 4363, 2132, 221]
for number in digits:
    print(number+1)
    






